<?php

return [
    'password_confirm' => [
        'heading' => 'ยืนยันรหัสผ่าน',
        'description' => 'กรุณายืนยันรหัสผ่านของคุณเพื่อทำการดำเนินการนี้ให้เสร็จสิ้น',
        'current_password' => 'รหัสผ่านปัจจุบัน',
    ],
    'two_factor' => [
        'heading' => 'การยืนยันตัวตนแบบสองขั้นตอน',
        'description' => 'กรุณายืนยันการเข้าถึงบัญชีของคุณโดยป้อนรหัสจากแอปพลิเคชันตรวจสอบสิทธิ์ของคุณ',
        'code_placeholder' => 'XXX-XXX',
        'recovery' => [
            'heading' => 'การยืนยันตัวตนแบบสองขั้นตอน',
            'description' => 'กรุณายืนยันการเข้าถึงบัญชีของคุณโดยป้อนรหัสกู้คืนฉุกเฉินของคุณ',
        ],
        'recovery_code_placeholder' => 'abcdef-98765',
        'recovery_code_text' => 'ทำอุปกรณ์หายใช่ไหม?',
        'recovery_code_link' => 'ใช้รหัสกู้คืน',
        'back_to_login_link' => 'กลับไปที่หน้าเข้าสู่ระบบ',
    ],
    'profile' => [
        'account' => 'บัญชี',
        'profile' => 'โปรไฟล์',
        'my_profile' => 'โปรไฟล์ของฉัน',
        'subheading' => '',
        'personal_info' => [
            'heading' => 'ข้อมูลส่วนบุคคล',
            'subheading' => 'จัดการข้อมูลส่วนบุคคลของคุณ',
            'submit' => [
                'label' => 'บันทึกการเปลี่ยนแปลง',
            ],
            'notify' => 'บันทึกแล้ว',
        ],
        'password' => [
            'heading' => 'รหัสผ่าน',
            'subheading' => 'ต้องมีความยาวอย่างน้อย 8 ตัวอักษร',
            'submit' => [
                'label' => 'บันทึกการเปลี่ยนแปลง',
            ],
            'notify' => 'บันทึกแล้ว',
        ],
        '2fa' => [
            'title' => 'การยืนยันตัวตนแบบสองขั้นตอน',
            'description' => 'จัดการการยืนยันตัวตนแบบสองขั้นตอนสำหรับบัญชีของคุณ (แนะนำ)',
            'actions' => [
                'enable' => 'เปิดใช้งาน',
                'regenerate_codes' => 'สร้างรหัสกู้คืนใหม่',
                'disable' => 'ปิดใช้งาน',
                'confirm_finish' => 'ยืนยันและเสร็จสิ้น',
                'cancel_setup' => 'ยกเลิกการตั้งค่า',
            ],
            'setup_key' => 'คีย์การตั้งค่า',
            'must_enable' => 'คุณต้องเปิดใช้งานการยืนยันตัวตนแบบสองขั้นตอนเพื่อใช้งานแอปพลิเคชันนี้',
            'not_enabled' => [
                'title' => 'คุณยังไม่ได้เปิดใช้งานการยืนยันตัวตนแบบสองขั้นตอน',
                'description' => 'เมื่อเปิดใช้งานการยืนยันตัวตนแบบสองขั้นตอน คุณจะถูกถามรหัสรักษาความปลอดภัยแบบสุ่มระหว่างการยืนยันตัวตน คุณสามารถรับรหัสนี้ได้จากแอปพลิเคชัน Google Authenticator ในโทรศัพท์ของคุณ',
            ],
            'finish_enabling' => [
                'title' => 'เสร็จสิ้นการเปิดใช้งานการยืนยันตัวตนแบบสองขั้นตอน',
                'description' => 'ในการเสร็จสิ้นการเปิดใช้งานการยืนยันตัวตนแบบสองขั้นตอน โปรดสแกนรหัส QR ต่อไปนี้โดยใช้แอปพลิเคชันตรวจสอบสิทธิ์ในโทรศั
พท์ของคุณ หรือป้อนคีย์การตั้งค่าและระบุรหัส OTP ที่สร้างขึ้น',
            ],
            'enabled' => [
                'notify' => 'เปิดใช้งานการยืนยันตัวตนแบบสองขั้นตอนแล้ว',
                'title' => 'คุณได้เปิดใช้งานการยืนยันตัวตนแบบสองขั้นตอนแล้ว!',
                'description' => 'ขณะนี้ได้เปิดใช้งานการยืนยันตัวตนแบบสองขั้นตอนแล้ว ซึ่งช่วยให้บัญชีของคุณปลอดภัยยิ่งขึ้น',
                'store_codes' => 'รหัสเหล่านี้สามารถใช้กู้คืนการเข้าถึงบัญชีของคุณได้หากอุปกรณ์ของคุณสูญหาย คำเตือน! รหัสเหล่านี้จะแสดงเพียงครั้งเดียว',
            ],
            'disabling' => [
                'notify' => 'ปิดใช้งานการยืนยันตัวตนแบบสองขั้นตอนแล้ว',
            ],
            'regenerate_codes' => [
                'notify' => 'สร้างรหัสกู้คืนใหม่แล้ว',
            ],
            'confirmation' => [
                'success_notification' => 'ยืนยันรหัสแล้ว เปิดใช้งานการยืนยันตัวตนแบบสองขั้นตอนแล้ว',
                'invalid_code' => 'รหัสที่คุณป้อนไม่ถูกต้อง',
            ],
        ],
        'sanctum' => [
            'title' => 'โทเค็น API',
            'description' => 'จัดการโทเค็น API ที่อนุญาตให้บริการของบุคคลที่สามเข้าถึงแอปพลิเคชันนี้ในนามของคุณ',
            'create' => [
                'notify' => 'สร้างโทเค็นสำเร็จ!',
                'message' => 'โทเค็นของคุณจะแสดงเพียงครั้งเดียวเมื่อสร้าง หากคุณทำโทเค็นหาย คุณจะต้องลบและสร้างใหม่',
                'submit' => [
                    'label' => 'สร้าง',
                ],
            ],
            'update' => [
                'notify' => 'บันทึกแล้ว',
            ],
            'copied' => [
                'label' => 'คัดลอกแล้ว',
            ],
        ],
    ],
    'clipboard' => [
        'link' => 'คัดลอกไปยังคลิปบอร์ด',
        'tooltip' => 'คัดลอกแล้ว!',
    ],

    'fields' => [
        'avatar' => 'รูปประจำตัว',
        'email' => 'อีเมล',
        'login' => 'เข้าสู่ระบบ',
        'name' => 'ชื่อ',
        'password' => 'รหัสผ่าน',
        'password_confirm' => 'ยืนยันรหัสผ่าน',
        'new_password' => 'รหัสผ่านใหม่',
        'new_password_confirmation' => 'ยืนยันรหัสผ่าน',
        'token_name' => 'ชื่อโทเค็น',
        'token_expiry' => 'วันหมดอายุโทเค็น',
        'abilities' => 'ความสามารถ',
        '2fa_code' => 'รหัส',
        '2fa_recovery_code' => 'รหัสกู้คืน',
        'created' => 'สร้างเมื่อ',
        'expires' => 'หมดอายุ',
    ],
    'or' => 'หรือ',
    'cancel' => 'ยกเลิก',
];
